import Carousel from "../Carousel/Carousel.tsx";
import "../../styles/index.scss";
import styles from "./About.module.scss";

import React from "react";

const About: React.FC = () => {
  return (
    <section className={`${styles.about} container`} id="about">
      <h2 className={styles.tittle}>Про бригаду</h2>
      <Carousel />
      <p className={styles.text}>
        127-ма окрема бригада територіальної оборони (127 ОБрТрО, в/ч А7383)-
        кадроване в мирний час формування Сил територіальної оборони Збройних
        сил України у місті Харкові. Бригада перебуває у складі Регіонального
        управління «Схід» Сил ТрО.
      </p>
      <p className={styles.text}>
        За інформацією журналістів «Суспільного», 127-ма окрема бригада
        територіальної оборони стала першою механізованою бригадою
        територіальної оборони в Україні. Наразі, для вирішення надскладних
        завдань, вони потребують сучасних дронів. Ці дрони допоможуть у
        виконанні бойових завдань та забезпеченні безпеки наших захисників,
        значно підвищуючи їх ефективність та оперативність.
      </p>
    </section>
  );
};

export default About;
